'''
1.
Вместо заполнения значениями по рандомному ключу словаря, записывал в последовательный набор ключей рандомные величины
значений. Использовал другой диапазон значений (не от 0 до 99).

Использовал метод pop(), который выводит в консоль значение словаря по ключу и удаляет пару ключ-значение,
вместо вывода в консоль пары ключ-значение и явного удаление с помощью функции "del". Так как в выводе
в моей программы значения выводились в консоль по последовательным кллючам, то не использовал проверку на существование
ключа, как в эталонном решении.

2.
Выполнил ненужную инициализацию словаря внутри функции. Его инициализацию удобней было сделать как в эталонном решении.
Использовал два цикла вместо одного для подсчета количества элементов и заполнения выходного списка. Следоваетльно
программа делает ненужные вычисления.
'''
