'''
Функия сортировки применена таже.

Тоже делал тест (№4 в эталонном решении) на пустой массив, однако сравнивал не длину массива а пустой массив с
результатов функции сортировки.

Для проверки корректности работы сортировки, вместо случайного теста (№1 в эталонном решении)
с проверкой 1000 массивов, использовал лишь одну проверку, сравнив массив отсортированный с помощью нашей функции
и отсортированный массив, который я написал руками. Случайный тест в эталонном решении проверит больше значений, а
значит будет более показательным.

Не выполнил проверку граничных значений, как в эталонном решении (№3).

Не сделал регрессионный тест, как в эталонном решении (№2).
'''
